Revit 2024 API
LightFamily.GetLightType Method
 Return a LightType object for the light type at the given index
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public LightType GetLightType(
	int index
)
Visual Basic
Public Function GetLightType ( _
	index As Integer _
) As LightType
Visual C++
public:
LightType^ GetLightType(
	int index
)
Parameters
index
Type: System.Int32
 The index of the light type
Return Value
 A LightType object for the light type at the given index
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The index is the argument that is being validated The index is not valid because it does not correspond to a valid light type
See Also
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace